# Pandas

## 개요
- Numpy 기반 데이터 분석 특화 라이브러리
- 복잡한 데이터 분석에 특화
- Numpy 와 달리 데이터 타입이 다양하게 섞여 있어도 처리 가능

## 구조적 데이터 생성하기

### Series() 활용한 데이터 생성

- s = pd.Series(seq_data) # Series 형식의 데이터 생성

- s = pd.Series(seq_data, index = index_seq) # 데이터에 인덱스 추가

- s = pd.Series(dict_data) # 데이터와 인덱스를 함께 입력

In [1]:
import pandas as pd

In [2]:
s1 = pd.Series([10, 20, 30, 40, 50])

In [3]:
s1

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [4]:
s1.index

RangeIndex(start=0, stop=5, step=1)

In [5]:
s1.values

array([10, 20, 30, 40, 50], dtype=int64)

In [6]:
s2 = pd.Series(['a', 'b', 'c', 1, 2, 3])

In [7]:
s2 # text 우선 저장 --> dtype: object

0    a
1    b
2    c
3    1
4    2
5    3
dtype: object

In [8]:
import numpy as np

In [9]:
s3 = pd.Series([np.nan, 10, 30])

In [10]:
s3 # 0번째 index 를 빈 값으로 인식 --> dtype: float64

0     NaN
1    10.0
2    30.0
dtype: float64

In [11]:
# 특별한 index 를 지정할 경우 (ex. 날짜)
index_date = ['2020-10-07', '2020-10-08', '2020-10-09', '2020-10-10']

In [12]:
s4 = pd.Series([200, 195, np.nan, 205], index=index_date)

In [13]:
s4 # dtype: float64

2020-10-07    200.0
2020-10-08    195.0
2020-10-09      NaN
2020-10-10    205.0
dtype: float64

In [14]:
# dict 형태로 입력 (key - value 쌍으로 입력)

s5 = pd.Series({'국어': 100, '영어': 95, '수학': 90})

In [15]:
s5

국어    100
영어     95
수학     90
dtype: int64

### 날짜 자동 생성 : date_range()

* 원하는 날짜를 자동 생성하는 방법
    - pd.date_range(start=None, periods=None, freq='0')
    - `yyyy-mm-dd` 기본형태(연도-월-일)
    
* `date_range()` 함수의 `freq` 옵션

In [16]:
pd.date_range(start='2020-01-01', end='2020-01-07')

DatetimeIndex(['2020-01-01', '2020-01-02', '2020-01-03', '2020-01-04',
               '2020-01-05', '2020-01-06', '2020-01-07'],
              dtype='datetime64[ns]', freq='D')

In [17]:
pd.date_range(start='2020/01/01', end='2020.01.07')

DatetimeIndex(['2020-01-01', '2020-01-02', '2020-01-03', '2020-01-04',
               '2020-01-05', '2020-01-06', '2020-01-07'],
              dtype='datetime64[ns]', freq='D')

In [18]:
pd.date_range(start='2020-01-01', periods = 7)

DatetimeIndex(['2020-01-01', '2020-01-02', '2020-01-03', '2020-01-04',
               '2020-01-05', '2020-01-06', '2020-01-07'],
              dtype='datetime64[ns]', freq='D')

In [19]:
pd.date_range(start='2020-01-01', periods = 4, freq='2D')

DatetimeIndex(['2020-01-01', '2020-01-03', '2020-01-05', '2020-01-07'], dtype='datetime64[ns]', freq='2D')

In [20]:
pd.date_range(start='2020-01-01', periods=4, freq='W')

DatetimeIndex(['2020-01-05', '2020-01-12', '2020-01-19', '2020-01-26'], dtype='datetime64[ns]', freq='W-SUN')

In [21]:
pd.date_range(start='2020-01-01', periods=12, freq='2BM')

DatetimeIndex(['2020-01-31', '2020-03-31', '2020-05-29', '2020-07-31',
               '2020-09-30', '2020-11-30', '2021-01-29', '2021-03-31',
               '2021-05-31', '2021-07-30', '2021-09-30', '2021-11-30'],
              dtype='datetime64[ns]', freq='2BM')

In [22]:
pd.date_range(start='2020-01-01', periods=4, freq='QS')

DatetimeIndex(['2020-01-01', '2020-04-01', '2020-07-01', '2020-10-01'], dtype='datetime64[ns]', freq='QS-JAN')

In [23]:
index_date = pd.date_range(start='2020-03-01', periods=5, freq="QS-JAN")

In [24]:
pd.Series([20, 30, 40, 50, 70], index=index_date)

2020-04-01    20
2020-07-01    30
2020-10-01    40
2021-01-01    50
2021-04-01    70
Freq: QS-JAN, dtype: int64

### DataFrame() 을 활용한 데이터 생성

- 자료(Data) 를 담는 틀(Frame)
- 라벨이 있는 2차원 데이터를 생성하고 처리할 수 있음
- 2차원 구조의 데이터를 간편하게 생성 가능

```python
df = pd.DataFrame(data [, index = index_data, columns = columns_data])
```

In [25]:
import pandas as pd

In [26]:
pd.DataFrame([[1, 2, 3], [4, 5, 6], [7, 8, 9]])

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [27]:
# numpy 에서 생성한 object 를 넣어서 DataFrame 만들 수도 있음
import numpy as np

data_list = np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]])

In [28]:
pd.DataFrame(data_list)

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [29]:
# index 와 column 값 바꾸기

index_date = pd.date_range('2021-03-01', periods=3)
index_date

DatetimeIndex(['2021-03-01', '2021-03-02', '2021-03-03'], dtype='datetime64[ns]', freq='D')

In [30]:
column_list = ['A', 'B', 'C']

In [31]:
pd.DataFrame(data_list, index=index_date, columns=column_list)

            A  B  C
2021-03-01  1  2  3
2021-03-02  4  5  6
2021-03-03  7  8  9

In [32]:
# dictionary --> key, value 있으므로 쉽게 DF 생성 가능

table_data = {
    '연도': [2020, 2021, 2021, 2022, 2022],
    '지사': ['한국', '한국', '미국', '한국', '미국'],
	'고객수': [250, 450, 300, 200, 300]
}

In [33]:
table_data

{'연도': [2020, 2021, 2021, 2022, 2022],
 '지사': ['한국', '한국', '미국', '한국', '미국'],
 '고객수': [250, 450, 300, 200, 300]}

In [34]:
df = pd.DataFrame(table_data)
df

     연도  지사  고객수
0  2020  한국  250
1  2021  한국  450
2  2021  미국  300
3  2022  한국  200
4  2022  미국  300

In [35]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [36]:
df.columns

Index(['연도', '지사', '고객수'], dtype='object')

In [37]:
df.values

array([[2020, '한국', 250],
       [2021, '한국', 450],
       [2021, '미국', 300],
       [2022, '한국', 200],
       [2022, '미국', 300]], dtype=object)

In [38]:
d1 = pd.Series([1, 2, 3, 4, 5])

In [39]:
d2 = pd.Series([10, 20, 30, 40, 50])

In [40]:
d1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [41]:
d2

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [42]:
d1 + d2

0    11
1    22
2    33
3    44
4    55
dtype: int64

In [43]:
d2 - d1

0     9
1    18
2    27
3    36
4    45
dtype: int64

In [44]:
d2/d1

0    10.0
1    10.0
2    10.0
3    10.0
4    10.0
dtype: float64

In [45]:
d3 = pd.Series([1, 2, 3])
d4 = pd.Series([10, 20, 30, 40, 50])

In [46]:
d3 + d4 # 데이터 개수가 달라도 연산 가능

0    11.0
1    22.0
2    33.0
3     NaN
4     NaN
dtype: float64

In [47]:
d4 - d3

0     9.0
1    18.0
2    27.0
3     NaN
4     NaN
dtype: float64

In [48]:
d4 / d3

0    10.0
1    10.0
2    10.0
3     NaN
4     NaN
dtype: float64

In [49]:
table_d1 = {
    'A': [1, 2, 3, 4, 5],
    'B': [10, 20, 30, 40, 50],
    'C': [100, 200, 300, 400, 500]
}
df1 = pd.DataFrame(table_d1)
df1

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [50]:
table_d2 = {
    'A': [6, 7, 8],
    'B': [60, 70, 80],
    'C': [600, 70, 800]
}
df2 = pd.DataFrame(table_d2)
df2

   A   B    C
0  6  60  600
1  7  70   70
2  8  80  800

In [51]:
df1 + df2

      A      B       C
0   7.0   70.0   700.0
1   9.0   90.0   270.0
2  11.0  110.0  1100.0
3   NaN    NaN     NaN
4   NaN    NaN     NaN

In [52]:
table_d3 = {
    '봄': [266.5, 275.3, 265.9, 222.2, 308.8],
    '여름': [763.7, 528.6, 574.6, 352.4, 477.5],
    '가을': [365.4, 274.7, 296.6, 287.8, 356.7],
    '겨울': [187.3, 69.8, 85.9, 89.1, 104.5]
}
columns_list = ['봄', '여름', '가을', '겨울']
index_list =['2022', '2023', '2024', '2025', '2026']

In [53]:
df3 = pd.DataFrame(table_d3, index=index_list, columns=columns_list)
df3

          봄     여름     가을     겨울
2022  266.5  763.7  365.4  187.3
2023  275.3  528.6  274.7   69.8
2024  265.9  574.6  296.6   85.9
2025  222.2  352.4  287.8   89.1
2026  308.8  477.5  356.7  104.5

In [54]:
# axis = 0 이 default

df3.mean()

봄     267.74
여름    539.36
가을    316.24
겨울    107.32
dtype: float64

In [55]:
# record 별 평균

df3.mean(axis=1)

2022    395.725
2023    287.100
2024    305.750
2025    237.875
2026    311.875
dtype: float64

## 데이터 연산

- Pandas 의 `Series()` 와 `DataFrame()` 으로 생성한 데이터끼리 사칙연산 가능 
- DataFrame 형식 Data 연산 (길이가 같지 않아도 연산 가능)

## 데이터를 원하는 대로 선택하기

- 다수의 데이터가 입력된 데이터 표에서 원하는 데이터만을 선택하는 기능

```python
DataFrame_data.head([n]) # 처음 일부분 선택
DataFrame_data.tail([n]) # 뒤 일부분 선택
DataFrame_data[행 시작 위치:행 끝 위치] # 연속된 구간의 행 데이터 선택
```

- index 항목에서의 행 선택

```python
DataFrame_data.loc[index_name] # 인덱스 지정하여 행 선택
DataFrame_data.loc[시작 index_name: 끝 index_name]  # index 를 구간으로 지정하여 행 선택
```

- 열 선택

```python
DataFrame_data[column_name] # 하나의 열 선택하는 경우
DataFrame_data[column_name][시작 index_name : 끝 index_name] # 하나의 열 선택하는 경우
DataFrame_data[column_name][시작 index_pos : 끝 index_pos] # 하나의 열 선택, 범위를 지정해 원하는 데이터 선택
```

- DataFrame 의 데이터 중 하나의 원소만 선택하는 방법

```python
DataFrame_data.loc[index_name][column_name]
DataFrame_data.loc[index_name, column_name]
DataFrame_data[column_name][index_name]
DataFrame_data[column_name][index_pos]
DataFrame_data[column_name][index_name]
```

- 데이터의 행과 열을 바꾸는 전치

```python
DataFrame_data.T
```

## 데이터 통합하기

###  세로 방향으로 통합하기

- DataFrame 에서 columns 가 같은 두 데이터를 세로 방향으로 (index 가 증가하는 방향으로) 합하려면 `append()` 를 이용

```python
DataFrame_data1.append(DataFrame_data2 [,ignore_index=True])
```

- `ignore_index=True` : 값들이 Sequence 하게 변하게 됨
- 두 데이터가 결합할 때 한 쪽 데이터 없으면 NaN 값이 들어가게 됨

In [56]:
df1 = pd.DataFrame({'Class1': [45, 46, 48, 50],
                   'Class2': [40, 41, 44, 48]})
df1

   Class1  Class2
0      45      40
1      46      41
2      48      44
3      50      48

In [57]:
df2 = pd.DataFrame({'Class1': [41, 42],
                   'Class2': [43, 45]})
df2

   Class1  Class2
0      41      43
1      42      45

In [58]:
df1.append(df2)

   Class1  Class2
0      45      40
1      46      41
2      48      44
3      50      48
0      41      43
1      42      45

In [59]:
df1.append(df2, ignore_index=True)

   Class1  Class2
0      45      40
1      46      41
2      48      44
3      50      48
4      41      43
5      42      45

In [60]:
df3 = pd.DataFrame({'Class1': [48, 38]})
df3

   Class1
0      48
1      38

In [61]:
df2

   Class1  Class2
0      41      43
1      42      45

In [62]:
df2.append(df3, ignore_index=True)

C:\Users\kkobu\Anaconda3\lib\site-packages\pandas\core\frame.py:7123: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  sort=sort,

   Class1  Class2
0      41    43.0
1      42    45.0
2      48     NaN
3      38     NaN

### 가로 방향으로 통합하기

- `join()` 을 이용하여 가로 방향으로 데이터 합치기

```python
DataFrame_data1.join(DataFrame_data2)
```

In [63]:
df4 = pd.DataFrame({'Class3': [49, 47, 45, 48]})
df4

   Class3
0      49
1      47
2      45
3      48

In [64]:
df1

   Class1  Class2
0      45      40
1      46      41
2      48      44
3      50      48

In [65]:
df1.join(df4)

   Class1  Class2  Class3
0      45      40      49
1      46      41      47
2      48      44      45
3      50      48      48

In [66]:
index_label = ['a', 'b', 'c', 'd']
df1a = pd.DataFrame({'Class1': [48,46,49,50],
                    'Class2': [44,46,42,41]}, index=index_label)
df4a = pd.DataFrame({'Class3': [43, 41, 42, 47]}, index=index_label)

In [67]:
df1a

   Class1  Class2
a      48      44
b      46      46
c      49      42
d      50      41

In [68]:
df4a

   Class3
a      43
b      41
c      42
d      47

In [69]:
df1a.join(df4a)

   Class1  Class2  Class3
a      48      44      43
b      46      46      41
c      49      42      42
d      50      41      47

In [70]:
df5 = pd.DataFrame({'Class4': [42, 47]})
df5

   Class4
0      42
1      47

In [71]:
df1.join(df5)

   Class1  Class2  Class4
0      45      40    42.0
1      46      41    47.0
2      48      44     NaN
3      50      48     NaN

In [72]:
df6 = pd.DataFrame({'판매월': ['9월', '10월', '11월', '12월'],
                   '제품C': [120, 167, 214, 209],
                   '제품D': [190, 210, 348, 365]})
df6

   판매월  제품C  제품D
0   9월  120  190
1  10월  167  210
2  11월  214  348
3  12월  209  365

In [73]:
df7 = pd.DataFrame({'판매월': ['9월', '10월', '11월', '12월'],
                   '제품A': [135, 167, 252, 264],
                    '제품B': [189, 241, 218, 314]})
df7

   판매월  제품A  제품B
0   9월  135  189
1  10월  167  241
2  11월  252  218
3  12월  264  314

In [74]:
# 두 테이블 merge 해서 하나의 테이블로 만들기

df6.merge(df7)

   판매월  제품C  제품D  제품A  제품B
0   9월  120  190  135  189
1  10월  167  210  167  241
2  11월  214  348  252  218
3  12월  209  365  264  314

- left: 왼쪽 데이터는 모두 선택하고 지정한 열(key)에 값이 있는 오른쪽 데이터를 선택
- right: 오른쪽 데이터는 모두 선택하고 지정한 열(key)에 값이 있는 왼쪽 데이터를 선택
- outer: 지정된 열(key)을 기준으로 왼쪽과 오른쪽 데이터를 모두 선택
- inner: 지정된 열(key)을 기준으로 왼쪽과 오른쪽 데이터 중 공통 항목만 선택(기본값)

In [75]:
# 기준이 필요한 경우
# key 라는 column 값 기준으로 묶는 예

df_left = pd.DataFrame({'key': ['A', 'B', 'C'], 'left': [1, 2, 3]})
df_left

  key  left
0   A     1
1   B     2
2   C     3

In [76]:
df_right = pd.DataFrame({'key': ['A', 'B', 'D'], 'right': [4, 5, 6]})
df_right

  key  right
0   A      4
1   B      5
2   D      6

In [77]:
df_left.merge(df_right, how='left', on='key') # left 를 기준으로 key 값을 가지고 merge

  key  left  right
0   A     1    4.0
1   B     2    5.0
2   C     3    NaN

In [78]:
 df_left.merge(df_right, how='right', on='key')

  key  left  right
0   A   1.0      4
1   B   2.0      5
2   D   NaN      6

In [79]:
 df_left.merge(df_right, how='outer', on='key') # outer merge : 모든 key 값 다 지정

  key  left  right
0   A   1.0    4.0
1   B   2.0    5.0
2   C   3.0    NaN
3   D   NaN    6.0

In [80]:
 df_left.merge(df_right, how='inner', on='key') # inner merge : 공통으로 존재하는 key 값만을 대상으로 merge

  key  left  right
0   A     1      4
1   B     2      5

## 데이터 파일을 읽고 쓰기

### 표 형식의 데이터 파일을 읽기

- `read_csv()` 를 통해 필드가 콤마로 구분된 파일 불러오기

```python
DataFrame_data = pd.read_csv(file_name, [,options])
```

- 파이썬 텍스트 파일의 기본 문자 인코딩 방식은 'utf-8'
- Pandas의 `read_csv()` 로 csv 파일 읽어올 때 텍스트 파일의 인코딩 형식에 따라 옵션을 지정해야 함

- 파이썬에서 파일의 경로를 표현할 때 역슬래쉬가 아닌 슬래쉬(/) 혹은 역슬래쉬 2개를 사용

### 표 형식의 데이터를 파일로 쓰기

- `to_csv()` 를 이용해 DataFrame 형식의 데이터를 텍스트 파일로 저장

```python
DataFrame_data = pd.to_csv(file_name[, options])
```

In [81]:
import pandas as pd

```python
pd.read_csv('C:\python_class\data\kbo.csv', encoding='cp949') # comma 로 구분
```

```python
pd.read_csv('C:\python_class\data\kbo.csv', encoding='cp949', sep='\tt') # tab 으로 구분
```

In [82]:
df_body = pd.DataFrame({'Weight': [72, 77, 65, 79],
                       'Height': [175, 182, 160, 168]},
                       index=['Yoon', 'Kwon', 'Shin', 'Kim'])

In [83]:
df_body

      Weight  Height
Yoon      72     175
Kwon      77     182
Shin      65     160
Kim       79     168

In [84]:
df_body.index.name = 'User' # index 이름을 지정할 수 있음

In [85]:
df_body

      Weight  Height
User
Yoon      72     175
Kwon      77     182
Shin      65     160
Kim       79     168

In [86]:
bmi = df_body['Weight']/(df_body['Height']/100)**2
bmi

User
Yoon    23.510204
Kwon    23.245985
Shin    25.390625
Kim     27.990363
dtype: float64

In [87]:
df_body['BMI'] = bmi
df_body

      Weight  Height        BMI
User
Yoon      72     175  23.510204
Kwon      77     182  23.245985
Shin      65     160  25.390625
Kim       79     168  27.990363

```python
# df_body 를 csv 파일로 생성
df_body.to_csv('C:/python_class/data/body.csv')


# txt 파일로 생성
file_name = 'C:\python_class\body_cp949.txt'
df_body.to_csv(file_name, sep=' ', encoding="cp949")
```

## 실습

### 1번 문제
회사의 직원 몇명의 정보를 포함하는 다음 두 개의 DataFrame 을 merge 를 활용하여 결합하라

In [88]:
df1 = pd.DataFrame({'employee': ['김주임', '정부장', '오대리', '박대리'], 'group': ['Laboratory1', 'Engineering', 'Laboratory2', 'Accounting']})
df2 = pd.DataFrame({'employee': ['김주임', '정부장', '오대리', '박대리'], 'hire_date': [2016, 2017, 2018, 2018]})

In [89]:
df3 = pd.merge(df1, df2)

In [90]:
df3

  employee        group  hire_date
0      김주임  Laboratory1       2016
1      정부장  Engineering       2017
2      오대리  Laboratory2       2018
3      박대리   Accounting       2018

### 2번 문제

Numpy를 활용하여 50개의 난수를 생성시키고 이를 Pandas 의 시리즈형 데이터로 변환하라

In [91]:
import numpy as np
import pandas as pd
list = np.random.rand(50)
data=pd.Series(list)
data

0     0.350316
1     0.264089
2     0.862471
3     0.968067
4     0.284121
5     0.538296
6     0.813076
7     0.456010
8     0.709506
9     0.341188
10    0.856914
11    0.157263
12    0.160927
13    0.639069
14    0.609277
15    0.502727
16    0.848288
17    0.498941
18    0.414332
19    0.803090
20    0.970349
21    0.527117
22    0.334488
23    0.549187
24    0.991243
25    0.345965
26    0.346122
27    0.876262
28    0.436587
29    0.310163
30    0.688572
31    0.136526
32    0.596055
33    0.327117
34    0.704857
35    0.929268
36    0.777319
37    0.584724
38    0.872755
39    0.641016
40    0.787437
41    0.995551
42    0.063345
43    0.803690
44    0.677476
45    0.363588
46    0.590522
47    0.703900
48    0.371556
49    0.188408
dtype: float64

### 3번 문제

다음은 표준분포로 random 으로 수를 생성하여, df 를 만들어주는 코드

```python
a = np.random.standard_normal(12, 4)
df = pd.DataFrame(a)
```

df.columns, pd.date_range, df.index 를 활용하여 column, index 변경하기

In [92]:
import numpy as np # random 값
import pandas as pd
a = np.random.standard_normal((12, 4))
df = pd.DataFrame(a)
df

           0         1         2         3
0  -0.293793 -0.939866 -0.274759  0.833106
1   0.179898  1.605557  0.113493  0.952290
2  -0.790744  1.147939  0.751204 -0.153367
3  -0.495234  0.356038 -1.765367  0.450545
4   0.152880  1.799064 -0.895771 -1.128698
5  -0.225541  0.808007 -0.103880 -0.327456
6   1.047162 -1.297238  1.209198 -0.379667
7   1.195311  1.311854  1.628618  0.519592
8  -0.478753  1.102473  0.236619 -1.533756
9  -0.028604  0.547068 -1.472898 -0.566654
10 -0.980214 -1.592026  0.903140 -0.059229
11  0.183672 -1.479010 -1.029784 -1.026529

In [93]:
df.columns = [['No1', 'No2', 'No3', 'No4']]
dates = pd.date_range('2020-01-01', periods=12, freq='M') # Month 중 마지막 날 
df.index = dates
df['Quarter'] = ['Q1', 'Q1', 'Q1', 'Q2', 'Q2', 'Q2', 'Q3', 'Q3', 'Q3', 'Q4', 'Q4', 'Q4']

In [94]:
df

                 No1       No2       No3       No4 Quarter
2020-01-31 -0.293793 -0.939866 -0.274759  0.833106      Q1
2020-02-29  0.179898  1.605557  0.113493  0.952290      Q1
2020-03-31 -0.790744  1.147939  0.751204 -0.153367      Q1
2020-04-30 -0.495234  0.356038 -1.765367  0.450545      Q2
2020-05-31  0.152880  1.799064 -0.895771 -1.128698      Q2
2020-06-30 -0.225541  0.808007 -0.103880 -0.327456      Q2
2020-07-31  1.047162 -1.297238  1.209198 -0.379667      Q3
2020-08-31  1.195311  1.311854  1.628618  0.519592      Q3
2020-09-30 -0.478753  1.102473  0.236619 -1.533756      Q3
2020-10-31 -0.028604  0.547068 -1.472898 -0.566654      Q4
2020-11-30 -0.980214 -1.592026  0.903140 -0.059229      Q4
2020-12-31  0.183672 -1.479010 -1.029784 -1.026529      Q4